app/controllers/analyze_inventory_controller.rb

SELECT "products".* FROM "products" INNER JOIN "brands" ON "brands".id = "products".brand_id WHERE (products.name ILIKE E'%Papel%') ORDER BY products.name ASC
SELECT * FROM "brands" WHERE ("brands"."id" = 1)
---
  def index
    @products = Product.find(:all, :joins => :brand, :order => 'name')