app/controllers/analyze_inventory_controller.rb

SELECT * FROM "products" WHERE (products.name ILIKE E'%Copo%')
SELECT count(*) AS count_all FROM "products" WHERE (products.name ILIKE E'%Copo%')
---
  def index
#    @products = Product.find(:all, :joins => :brand, :order => 'name')
#
#    respond_to do |format|
#      format.html
#      format.xls {
#        render :xls => @products.to_xls(:except => [:created_at,:updated_at])
#      }
#    end

     @search = Product.with_brand.ascend_by_name.search(params[:search])
     @products, @products_count = @search.all, @search.count

SELECT * FROM "products" WHERE (stock_ammount = stock_minimum)
SELECT count(*) AS count_all FROM "products" WHERE (stock_ammount = stock_minimum)
---
  def stock_alert
    @search = Product.stock_alert.search(params[:search])
    @products, @products_count = @search.all, @search.count