app/controllers/products_controller.rb

SELECT * FROM "brands" WHERE ("brands"."id" = 1)
---
  def index
    index! { @products = Product.find(:all, :joins => :brand, :order => 'name') }