app/controllers/purchases_controller.rb

SELECT * FROM "purchases"
---
  def index
    @purchases = Purchase.all

SELECT * FROM "purchases" WHERE ("purchases"."id" = 1)
---
  def show
    @purchase = Purchase.find(params[:id])

INSERT INTO "purchases" ("created_at", "updated_at", "date") VALUES('2010-04-01 19:33:40', '2010-04-01 19:33:40', '2010-04-01')
---
  def create
    @purchase = Purchase.new(params[:purchase])
    if @purchase.save

SELECT * FROM "purchases" WHERE ("purchases"."id" = 2)
---
  def edit
    @purchase = Purchase.find(params[:id])