app/controllers/sales_controller.rb

  def index
    @sales = Sale.all
---
SELECT * FROM "sales"

  def show
    @sale = Sale.find(params[:id])
---
SELECT * FROM "sales" WHERE ("sales"."id" = 1)

  def create
    @sale = Sale.new(params[:sale])
    if @sale.save
---
INSERT INTO "sales" ("created_at", "updated_at", "date", "customer_id") VALUES('2010-05-28 12:41:46.653688', '2010-05-28 12:41:46.653688', '2010-05-28', NULL) RETURNING "id"

  def edit
    @sale = Sale.find(params[:id])
---
SELECT * FROM "sales" WHERE ("sales"."id" = 1)

  def update
    @sale = Sale.find(params[:id])
---
SELECT * FROM "sales" WHERE ("sales"."id" = 1)